Revit 2026 API

# RibbonItemGetContextualHelp Method

---

Gets the contextual help bound with this control.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ContextualHelp GetContextualHelp()
```
```vb
Public Function GetContextualHelp As ContextualHelp
```
```cpp
public:
ContextualHelp^ GetContextualHelp()
```
```fsharp
member GetContextualHelp : unit -> ContextualHelp
```

#### Return Value

ContextualHelpThe contextual help assigned to the item, or  if there is no binding assigned.

#### Reference

RibbonItem Class

Autodesk.Revit.UI Namespace